import React from "react";

const styles = {
  backgroundColor: "rgb(230, 236, 240)",
  paddingBottom: "8px 20px 8px 0",
  height: "40px"
};

export default function ContentsPrf() {
  return (
    <>
      <h2 style={styles}>Profile</h2>
      <div>
        <h3>Pathfinderの何が面白いか？</h3>
        <p>■キャラの魅力</p>
        <p>
          Pathfinderでは仲間達がとにかく興味をそそる。
          みんなもそうだろう？初めはどの仲間も急に出てきて主人公に絡むから、見た目や言葉遣いでしか判断しないんじゃないかな。
          こいつはいつか裏切るんじゃないか？とか、こいつは好きかもとかね。
          でも、ストーリーを進めていると唐突に仲間の個人イベントが発生する。そして「ええ！？」という予測できない展開が起きて一旦終わる。あとで仲間に話を聞くと個人的な成り立ちや考えを吐露してくれる。嫌いだったキャラについては「お前はそんな過去が・・・私が間違っていた」となって愛着が湧く。好きなキャラはなおのこと。
          しかもその仲間達の個人イベントはそこでは完全に終わらない。忘れた頃にどこかのロケーションで唐突に続きが始まるんだ。
          そしてそこでの自分の判断が顛末に影響を与えちゃう。 やめられないよね。
        </p>
        <p>
          バトルについては微妙かもしれない。
          XCOMやDivinityのような戦術RPGを楽しんできた人たち（もちろん私もその一人）にとっては、バフとデバフでサイコロの出目に変化を与えるだけの戦いにうんざりする時が来るかもしれない。
          Pathfinderではクラスや種族の種類の豊富さが比類ない。メインクラスが20種類ほどあって、サブクラスがそれぞれ4つあるゲームなんてそうそうお目にかからないだろう？
          さらに種族を選び種族の中でのマイナー種族を選択して、生まれは貴族か？平民か？信仰する神まで決定する。
          初めてプレイした時は眩暈がしたし、実際キャラ作成に3日かかった。
          だからロールプレイの幅はほぼ無限でそういった楽しみは大きいと言える。
          バトルについては微妙かもしれない。
          XCOMやDivinityのような戦術RPGを楽しんできた人たち（もちろん私もその一人）にとっては、バフとデバフでサイコロの出目に変化を与えるだけの戦いにうんざりする時が来るかもしれない。
          Pathfinderではクラスや種族の種類の豊富さが比類ない。メインクラスが20種類ほどあって、サブクラスがそれぞれ4つあるゲームなんてそうそうお目にかからないだろう？
          さらに種族を選び種族の中でのマイナー種族を選択して、生まれは貴族か？平民か？信仰する神まで決定する。
          初めてプレイした時は眩暈がしたし、実際キャラ作成に3日かかった。
          だからロールプレイの幅はほぼ無限でそういった楽しみは大きいと言える。
          バトルについては微妙かもしれない。
          XCOMやDivinityのような戦術RPGを楽しんできた人たち（もちろん私もその一人）にとっては、バフとデバフでサイコロの出目に変化を与えるだけの戦いにうんざりする時が来るかもしれない。
          Pathfinderではクラスや種族の種類の豊富さが比類ない。メインクラスが20種類ほどあって、サブクラスがそれぞれ4つあるゲームなんてそうそうお目にかからないだろう？
          さらに種族を選び種族の中でのマイナー種族を選択して、生まれは貴族か？平民か？信仰する神まで決定する。
          初めてプレイした時は眩暈がしたし、実際キャラ作成に3日かかった。
          だからロールプレイの幅はほぼ無限でそういった楽しみは大きいと言える。
          バトルについては微妙かもしれない。
          XCOMやDivinityのような戦術RPGを楽しんできた人たち（もちろん私もその一人）にとっては、バフとデバフでサイコロの出目に変化を与えるだけの戦いにうんざりする時が来るかもしれない。
          Pathfinderではクラスや種族の種類の豊富さが比類ない。メインクラスが20種類ほどあって、サブクラスがそれぞれ4つあるゲームなんてそうそうお目にかからないだろう？
          さらに種族を選び種族の中でのマイナー種族を選択して、生まれは貴族か？平民か？信仰する神まで決定する。
          初めてプレイした時は眩暈がしたし、実際キャラ作成に3日かかった。
          だからロールプレイの幅はほぼ無限でそういった楽しみは大きいと言える。
          バトルについては微妙かもしれない。
          XCOMやDivinityのような戦術RPGを楽しんできた人たち（もちろん私もその一人）にとっては、バフとデバフでサイコロの出目に変化を与えるだけの戦いにうんざりする時が来るかもしれない。
          Pathfinderではクラスや種族の種類の豊富さが比類ない。メインクラスが20種類ほどあって、サブクラスがそれぞれ4つあるゲームなんてそうそうお目にかからないだろう？
          さらに種族を選び種族の中でのマイナー種族を選択して、生まれは貴族か？平民か？信仰する神まで決定する。
          初めてプレイした時は眩暈がしたし、実際キャラ作成に3日かかった。
          だからロールプレイの幅はほぼ無限でそういった楽しみは大きいと言える。
          バトルについては微妙かもしれない。
          XCOMやDivinityのような戦術RPGを楽しんできた人たち（もちろん私もその一人）にとっては、バフとデバフでサイコロの出目に変化を与えるだけの戦いにうんざりする時が来るかもしれない。
          Pathfinderではクラスや種族の種類の豊富さが比類ない。メインクラスが20種類ほどあって、サブクラスがそれぞれ4つあるゲームなんてそうそうお目にかからないだろう？
          さらに種族を選び種族の中でのマイナー種族を選択して、生まれは貴族か？平民か？信仰する神まで決定する。
          初めてプレイした時は眩暈がしたし、実際キャラ作成に3日かかった。
          だからロールプレイの幅はほぼ無限でそういった楽しみは大きいと言える。
        </p>
      </div>
    </>
  );
}
